questions = [
    "Кто лидер 'Rising Volt Tacklers' в Pokemon Horizons?",
    "Кто из участников группы 'Metallica' погиб в автобусной аварии в 1986 году?",
    "Когда группа 'Metallica' приехала впервые в Россию?",
    "Когда Национальный день группы 'The Beatles'?",
    "Когда Лемми Килмистер(участник группы 'Motörhead') умер?",
    "Когда Роберт Трухилье присоединился к группе 'Metallica'?",
    "Когда 'Metallica' в последний раз посетила Россию?",
]
answers = [
    ["A) Liko", "B) Friede", "C) Murdock", "D) Dot"],
    ["A) Дэйв Мастейн", "B) Джеймс Хетфилд", "C) Кирк Хэмметт", "D) Клиф Бёртон"],
    ["A) 1986", "B) 1987", "C) 1991", "D) 1992"],
    ["A) 16 января", "B) 17 мая", "C) 11 июля", "D) 14 августа"],
    ["A) 2000", "B) 2010", "C) 2015", "D) 2021"],
    ["A) 1995", "B) 2003", "C) 2010", "D) 2016"],
    ["A) 1991", "B) 2007", "C) 2015", "D) 2019"],
]
right_answers = ["B", "D", "C", "A", "C", "B", "D"]
print("--------------------------------------------------------")
print("Добро пожаловать!")
print("Вы на шоу 'Кто хочет стать миллионером?'")
print("--------------------------------------------------------")
for i in range(len(questions)):
    print(questions[i])
    for j in range(len(answers[i])):
        print(answers[i][j])
    answer = input("Ваш ответ: ")
    if answer == right_answers[i]:
        print("Правильный ответ! + 100000 рублей")
    else:
        print("Неправильный ответ!")
        break
    print("--------------------------------------------------------")
print("--------------------------------------------------------")
print("Вы выиграли 1000000 рублей!")
print("--------------------------------------------------------")
